Revit 2027 API
BuiltInFailures.RevisionCloudFailures.ProhibitSwitchToIssuedRevision Property
 Can't add cloud to an Issued Revision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProhibitSwitchToIssuedRevision { get; }
Public Shared ReadOnly Property ProhibitSwitchToIssuedRevision As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProhibitSwitchToIssuedRevision {
	FailureDefinitionId^ get ();
}
static member ProhibitSwitchToIssuedRevision : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RevisionCloudFailures Class
Autodesk.Revit.DB Namespace